import matplotlib.pyplot as plt

# 准备数据
x = [0.4, 1, 0.8, 0, 1, 0.8, 1, 0.666666667, 1, 0.75, 0.8, 0.666666667, 0.75, 0.875, 1, 0.25, 1, 0.2, 0.333333333]
y = [0.035006935, 0.035912061, 0.041059628, 0.042249356, 0.047939443, 0.057654989, 0.068986027, 0.072111026, 0.073508788, 0.077436353, 0.077896058, 0.078102497, 0.086354821, 0.096020319, 0.099176345, 0.100541271, 0.101300592, 0.111702842, 0.128835707]

# 创建散点图
plt.scatter(x, y)

# 设置坐标轴范围
plt.xlim(0, 1.05)  # 设置x轴的范围
plt.ylim(0, 0.15)  # 设置y轴的范围

# 添加标签和标题
plt.xlabel('winRate')
plt.ylabel('cv')
plt.title('winRate-cv')

# 显示图表
plt.show()

# 准备数据
x = [0.4, 1, 0.8, 0, 1, 0.8, 1, 0.666666667, 1, 0.75, 0.8, 0.666666667, 0.75, 0.875, 1, 0.25, 1, 0.2, 0.333333333]
y = [101.8, 112.25, 105.6, 99.25, 118, 107.2, 123, 100, 125.6666667, 108.75, 108.4, 100, 105.5, 106.125, 107.5, 104.75, 114.4, 101.6, 105]

# 创建散点图
plt.scatter(x, y)

# 设置坐标轴范围
plt.xlim(0, 1.05)  # 设置x轴的范围
plt.ylim(99, 130)  # 设置y轴的范围

# 添加标签和标题
plt.xlabel('winRate')
plt.ylabel('mean')
plt.title('winRate-mean')

# 显示图表
plt.show()
